import numpy as np

'''Одномерный массив'''
# arr = np.array([5, 3, 2, 0, 7, 12, 9, 1, 3, 4])
#
# print(arr.dtype)
# print(arr.shape)


'''Двумерный массив'''
# Размерность двумерного массива описывают двумя числами - количеством строк и столбцов (именно в таком порядке).
# arr = np.array([[5, 3, 2, 0, 7],
#                 [4, 5, 7, 13, 6],
#                 [7, 3, 2, 6, 2],
#                 [18, 1, 9, 5, 0]])
# # Тип элементов
# print(arr.dtype) # int64
# # Размерность массива
# print(arr.shape) # (4, 5)


'''Массивы больших размерностей'''


'''Список против массива'''

